nathanlnw/TJ_TW703_cdma/bsp/stm32f407vgt6_RecDrv/app_712/gsm/Device_gsm.c
               VocREC.Sate=VOICEREC_DataRXing;
	        VocREC.ExcuteFlag=1;  
		 VocREC.file_read=0;   // clear  
    	} 
	
}

void VOC_REC_process(void)
{
      u16 str_wr=0;
	  
  if(VocREC.running==1)
  {
        
      switch(VocREC.Sate)
      {
           case VOICEREC_RECORDING:   
		   	                                     if( 1==VocREC.ExcuteFlag)
							           {  
							                    //  1 .   get name ,  clear df  area  , write multimedia index 
							                    DF_LOCK=enable; 
										memset(VocREC.file_name,0,sizeof(VocREC.file_name)); 	    									
										sprintf((char*)VocREC.file_name,"%d%d%d%d.amr",time_now.day,time_now.hour,time_now.min,time_now.sec);    
										Api_DFdirectory_Delete(voice);   //clear  voice  DF  area 
										rt_kprintf("\r\n			录音文件名称: %s \r\n",VocREC.file_name);	
										Save_MediaIndex(1,VocREC.file_name,0,0);     
										memset(VocREC.SendString,0,sizeof((const char*)VocREC.SendString));
										str_wr=strlen((const char*)VoiceRec_start);
										memcpy(VocREC.SendString,VoiceRec_start,str_wr); 
										//-------------------------------
										memcpy(VocREC.SendString+str_wr,VocREC.file_name,strlen((const char*)VocREC.file_name));
										str_wr+=strlen((const char*)VocREC.file_name);
										memcpy(VocREC.SendString+str_wr,"\",6\r\n",5);//  5s  voice  data       
                                                                      str_wr+=5;
										// debug
										rt_kprintf("\r\n %s",VocREC.SendString); 
										rt_hw_gsm_output((const char*)VocREC.SendString);   										

										 VocREC.ExcuteFlag=0;  
							            }
								   
								  break;
	    case  VOICEREC_DataRXing:   
			                                   if( 1==VocREC.ExcuteFlag)
							       {    
							              if(VocREC.filesize>VocREC.file_read)
							              { 
							                   	memset(VocREC.SendString,0,sizeof((const char*)VocREC.SendString));
										str_wr=strlen((const char*)VoiceRec_getdata);
										memcpy(VocREC.SendString,VoiceRec_getdata,str_wr); 
										//-------------------------------
										memcpy(VocREC.SendString+str_wr,VocREC.file_name,strlen((const char*)VocREC.file_name));
										str_wr+=strlen((const char*)VocREC.file_name);
										memcpy(VocREC.SendString+str_wr,"\",",2);
									       str_wr+=2;
										sprintf(VocREC.SendString+str_wr,"%d,256\r\n",VocREC.file_read);//  get 512 bytes from current offset
										// debug
										rt_kprintf("\r\n %s",VocREC.SendString); 

										rt_hw_gsm_output((const char*)VocREC.SendString);      
										
										 VocREC.ExcuteFlag=0;  	  
							              } 
									 
							        }
								   
			                                     break;
           case  VOICEREC_DEL:
		   	                                   if( 1==VocREC.ExcuteFlag)
							             {
							           	       memset(VocREC.SendString,0,sizeof((const char*)VocREC.SendString));
										str_wr=strlen((const char*)VoiceRec_delFile);
										memcpy(VocREC.SendString,VoiceRec_delFile,str_wr);  
										//memcpy(VocREC.SendString+str_wr,VocREC.file_name,strlen((const char*)VocREC.file_name));
										//str_wr+=strlen((const char*)VocREC.file_name);
										//memcpy(VocREC.SendString+str_wr,"\"\r\n",3);

										// debug
										rt_kprintf("\r\n %s",VocREC.SendString); 
										
										rt_hw_gsm_output((const char*)VocREC.SendString); 

										  VocREC.ExcuteFlag=0;  
										  VocREC.Sate=VOICEREC_IDLE; 
							           	}
								   
			                                     break;		
    	    case  VOICEREC_IDLE:
	   	                                            break;
											 
	   

      	} 
  }
}

void VOC_REC_dataGet(u8 *instr )
{
    u16  i=0,commer=0;//,j=0;
    u16  HEX_len=0,len=0;	
    u8   pic_buf[550]; 
	
   	if(VocREC.Sate==VOICEREC_DataRXing)  //%RECFGET: 6624,"0E360C764009 
    	{
              for(i=0;i<20;i++)   //  从前20个字节中找第一个"
		{
		      if(instr[i]==':')
			  	commer=i;
			if(instr[i]=='"')
				break;
		} 
		  sscanf(instr+commer+1, "%d", (u32*)&len); 
		  rt_kprintf("\r\n Rxlen=%d bytes\r\n     ",len); 
		  
            //  for(j=0;j<(len<<1);j++)
		  //          rt_kprintf("%c",instr[i+1+j]);     
		 if(VocREC.half_page==0)	  
		      {   HEX_len= GSM_AsciitoHEX_Convert(instr+i+1,(len<<1),VocREC.HEX);  VocREC.half_page=1;}	 
		else 
		 	{   HEX_len= GSM_AsciitoHEX_Convert(instr+i+1,(len<<1),VocREC.HEX+256);  VocREC.half_page=0;}
		
		 if(HEX_len!=len)
		 	    rt_kprintf("\r\n  voice  ASCII to HEX error!\r\n");

		  VocREC.file_read+=HEX_len;	 //  add 
 
		  if((VocREC.half_page==0) ||(VocREC.file_read>=VocREC.filesize))	 
		  {
			 //  write and  check
	                 DF_WriteFlashDirect( VocREC.curren_PageCNT,0,VocREC.HEX, 512); // 写一次一个Page 512Bytes
			   rt_kprintf(" \r\n ---- write  voice_current_page=%d  \r\n",VocREC.curren_PageCNT);      
	                         //---  read compare 
			    memset(pic_buf,0,sizeof(pic_buf)); 
			    DF_ReadFlash(VocREC.curren_PageCNT,0,pic_buf, 512);      
			    for(i=0;i<512;i++)
			   {		if(pic_buf[i]!=VocREC.HEX[i])
			    	       {
			    	             rt_kprintf(" \r\n ----read not equal write  where i=%d  \r\n",i);  
						break;		 
			    	        }
			    }	                 
	                //------------   			
			 VocREC.curren_PageCNT++;
		  }		  	
					
		 if(VocREC.file_read>=VocREC.filesize)
		 {    //   最后一包
                       //--------------------------
                       VocREC.curren_PageCNT=SoundStart_offdet;
			  memset(pic_buf,0,sizeof(pic_buf)); 
                       memcpy(pic_buf,(u8*)&VocREC.filesize,4);	  // filesize 
                       HEX_len=strlen((const char*)VocREC.file_name); // get filename len
			  memcpy(pic_buf+4,VocREC.file_name,HEX_len);			  
			  DF_WriteFlashDirect(SoundStart_offdet,0,pic_buf, 25);   //  4+20  1 (null)
			  DF_delay_ms(10); 			   
                      //--------------------------------------------------------------------------                  
	               rt_kprintf("\r\n        VoiceFileSize: %d Bytes\r\n   \r\n",VocREC.file_read); 
                      //-------------------------------------------------------------------------- 
                      VocREC.Sate=VOICEREC_DEL;  // 删除文件  
		        VocREC.ExcuteFlag=1;  
			 VocREC.file_read=0;   // clear  
			 //   开始准备上传 录音
			  Sound_send_start(); //开始上传
			 //--------------------------------------------------------------------------
		  }
               else
               {
	               VocREC.Sate=VOICEREC_DataRXing; 
		        VocREC.ExcuteFlag=1;   
               } 
    	} 
       else
	   	 rt_kprintf("\r\n Other VocREC.Sate=%d\r\n",VocREC.Sate);    


