nathanlnw/TJ_TW703_cdma/bsp/stm32f407vgt6_RecDrv/app_712/gsm/Device_gsm.c
	//---------------- High -------------------------------- 
    if((c>>4)>=10)
       Dest[dest_counter++]='A'+(c>>4)-10;
	else
	   Dest[dest_counter++]='0'+(c>>4);
	
    Dest[dest_counter]=0x00;

	//----------------- Low --------------------------------
	c=c&0x0F;
    if(c>=10)  
       Dest[dest_counter++]='A'+c-10;
	else 
	   Dest[dest_counter++]='0'+c; 
	Dest[dest_counter]=0x00;
  }
  
 return dest_counter; 
}
 u16  GSM_AsciitoHEX_Convert(u8 *Src_str,u16 Src_infolen,u8* Out_Str) 
 {
   u16 Counter=0,Out_Str_Len=0;
   u8  C=0;
	 
   Out_Str_Len=0;

     if((u8)Src_infolen&0x01)
   	{
   	     rt_kprintf("\r\n      接收ASCII信息不正确!   %u  \r\n",Src_infolen);     
   	}
   	
   for(Counter=0;Counter<Src_infolen;Counter++) 
   {   
        //--------------------------------------------------
           if((Counter&0x01)==1)
           	{
	           	 C=HexValue(*(Src_str+Counter));
			 if(C!=0xff)		 
	              {  
	                 Out_Str[Out_Str_Len]+=C;
	                 Out_Str_Len++; 
			  }	
			  else 
			  	  rt_kprintf("\r\n    Convert Error at:   %u  \r\n",Counter);    
           	}
	   else
		{
		     C=((HexValue(*(Src_str+Counter)))<<4);
                      Out_Str[Out_Str_Len]=(HexValue(*(Src_str+Counter)))<<4;	
		      if(C!=0xff)		 
	               {  
	                 Out_Str[Out_Str_Len]=C;
			  }	
			  else 
			  	  rt_kprintf("\r\n    Convert Error at2:   %u  \r\n",Counter);    			  
	   	}

   } 
	return Out_Str_Len;

 } 



void  Data_Send(u8* DataStr, u16  Datalen,u8  Link_Num)
{
    u16  i=0,packet_len=0;
     //  4. Send  


    //  4.1  发送要发送的信息长度  
	  memset(GSM_AsciiTx,0,sizeof(GSM_AsciiTx));	  
	 if(Link_Num==0)
	 {
	     strcat((char*)GSM_AsciiTx,Send_TCP);        // head
	     packet_len=strlen((const char*)Send_TCP);  
	 }
	 else
	 {
	     strcat((char*)GSM_AsciiTx,Send_ISP);        // head
	     packet_len=strlen((const char*)Send_ISP);   
	 }

      #ifdef MC8332_CDMA
          sprintf(GSM_AsciiTx+packet_len,"%d\r",Datalen);
          packet_len=strlen((const char*)GSM_AsciiTx);  
		  
		  if((Photo_sdState.photo_sending==0)&&(DispContent))   // 拍照时不输出相关信息 
		  {
		     rt_kprintf("%s",GSM_AsciiTx);
		  }

          // stuff  orignal  infor
          for(i=0;i<Datalen;i++)
          	{
               GSM_AsciiTx[packet_len+i]=DataStr[i];
          	}
		  
		  if((Photo_sdState.photo_sending==0)&&(DispContent))  // 拍照时不输出相关信息 
		  {
			 for(i=0;i<Datalen;i++)
				  rt_kprintf("%2X",GSM_AsciiTx[i+packet_len]);  	   
		  } 
		     packet_len+=Datalen;
			 rt_hw_gsm_output_Data(GSM_AsciiTx,packet_len);  
		 #endif 
        WatchDog_Feed();
        rt_thread_delay(RT_TICK_PER_SECOND/10);//DF_delay_ms(100);    

}

void End_Datalink(void)
{
       if(1==DataLink_EndFlag)          
	{
	   TCP2_Connect=0;
	   DataLink_Online=disable;  // off line

	  DataLink_EndCounter++;
	  if(DataLink_EndCounter==2) 
	  { 	rt_kprintf(" Ready to escape gprs \r\n");	 
		rt_hw_gsm_output(CutDataLnk_str2);
		if(DispContent)
		rt_kprintf(CutDataLnk_str2);
		DataDial.Dial_step_Retry=0;
		DataDial.Dial_step_RetryTimer=Dial_Dial_Retry_Time;
	  }
	  else
	  if(DataLink_EndCounter==3)
	  { 		
		rt_hw_gsm_output(CutDataLnk_str3);	// 关闭掉Internet
		 if(DispContent)
	       rt_kprintf(CutDataLnk_str3);	// 关闭掉Internet
	       DataDial.Dial_step_Retry=0;
		DataDial.Dial_step_RetryTimer=Dial_Dial_Retry_Time;

	  }    
	  else
	  if(DataLink_EndCounter==5)
	  { 		
		rt_hw_gsm_output(CutDataLnk_str4);	
		if(DispContent)
		 rt_kprintf(CutDataLnk_str4);	 
		DataDial.Dial_step_Retry=0;
		DataDial.Dial_step_RetryTimer=Dial_Dial_Retry_Time;
	  }
	    if(DataLink_EndCounter==8)
	  { 		
		rt_hw_gsm_output(CutDataLnk_str5);	 
		if(DispContent) 
		rt_kprintf(CutDataLnk_str5);   
		DataDial.Dial_step_Retry=0;
		DataDial.Dial_step_RetryTimer=Dial_Dial_Retry_Time;
	  }
	  else
	  if(DataLink_EndCounter>10)   
	  {
		DataLink_EndCounter=0; 
		DataLink_EndFlag=0;
		//-----------------------------
               CommAT.Initial_step=0;  
		 CommAT.Total_initial=0;  
               Redial_Init(); 
		 ModuleStatus &=~Status_GPRS;
	        rt_kprintf(" Redial Start\r\n");   
	      //-----------------------------
	  }
    }     

}

void  ISP_Timer(void)
{
    if((BD_ISP.ISP_running==1)&&DataLink_Status())     
    {
       BD_ISP.ISP_runTimer++; 
	   if(BD_ISP.ISP_runTimer>350)  
	   	{
            BD_ISP.ISP_runTimer=0;
			BD_ISP.ISP_running=0;//  clear
			SD_ACKflag.f_BD_ISPResualt_0108H=2;   
		    rt_kprintf("\r\n 升级下发超时，升级失败\r\n");    

		}
    } 

}
 
u8  GPRS_GSM_PowerON(void)
{	
	/*
              EM310开关机流程
              powerkey 拉低 50ms 开机  然后再拉低50ms关机
	*/
      if(GSM_PWR.GSM_power_over) 
			  return 1;
	
         GSM_PWR.GSM_powerCounter+=50;   

		  #ifdef   MC8332_CDMA
               	if((GSM_PWR.GSM_powerCounter>=10)&&(GSM_PWR.GSM_powerCounter<300))
			 {
			    GPIO_ResetBits(GPIOD,GPRS_GSM_Power);    // 关电
			    GPIO_ResetBits(GPIOD,GPRS_GSM_PWKEY); //  置低控高
			    GPIO_SetBits(GPIOD,GPRS_GSM_RST);   // 常态置高控低  
			    rt_kprintf(" cstep 1\r\n");   
			 }	
			 if((GSM_PWR.GSM_powerCounter>=300)&&(GSM_PWR.GSM_powerCounter<400))
			 {   /* 开电源，rst    ， 持续一段时间稳定*/
			      GPIO_SetBits(GPIOD,GPRS_GSM_Power);    //  开电
			      GPIO_ResetBits(GPIOD,GPRS_GSM_PWKEY); //  置低控高
				  rt_kprintf(" cstep 2\r\n");  
				  delay_ms(50);
				  GPIO_ResetBits(GPIOD,GPRS_GSM_RST);   // 20ms 后置低控高
				 
			 }	
			 if((GSM_PWR.GSM_powerCounter>=400)&&(GSM_PWR.GSM_powerCounter<600))   
			 {                                                 // 给GPS 上电持续          
			    GPIO_SetBits(GPIOD,GPRS_GSM_Power);    //  开电
			    GPIO_ResetBits(GPIOD,GPRS_GSM_PWKEY);    //  PWK 高
			    rt_kprintf(" cstep 3\r\n");   				
				gps_onoff(1);  // Gps module Power on	GPS 模块开电   
			 }	
			 if((GSM_PWR.GSM_powerCounter>=600)&&(GSM_PWR.GSM_powerCounter<800))   
			 {                                                   //   拉低2 s    准备开机
				GPIO_SetBits(GPIOD,GPRS_GSM_PWKEY);   //  PWK低
				 rt_kprintf(" cstep 4 \r\n");     
			 }	 
			 if((GSM_PWR.GSM_powerCounter>=800)&&(GSM_PWR.GSM_powerCounter<900))      
			 {
			    GPIO_ResetBits(GPIOD,GPRS_GSM_PWKEY);      //  PWK 高   
				rt_kprintf(" cstep 5\r\n");    
			 }	
			 if(GSM_PWR.GSM_powerCounter>=1000)         
			 {
				rt_kprintf("         %s","--GPRS Power over\r\n ");     
				GSM_PWR.GSM_PowerEnable=0; 
				GSM_PWR.GSM_powerCounter=0;
				GSM_PWR.GSM_power_over=1;  
				IMSIGet.Get_state=1;         //  cdma  没有AT%TSIM 
				   //-------add for re g 
			 }	
		#endif
	
	 return   0;	    
}

void GSM_Module_TotalInitial(void)
{
    
