nathanlnw/TJ_TW703_cdma/bsp/stm32f407vgt6_RecDrv/app_712/gsm/Device_gsm.c
		}			 
         }
		
		

	 //  work  on 
       if(DataDial.Dial_ON)
       {
             switch(DataDial.Dial_step)
             	{
                   case Dial_DialInit0: 
				   	 rt_hw_gsm_output(DialInit1);
			               //-----------------------------------------
                                      DataDial.start_dial_stateFLAG=1;   
				         //-----------------------------------------
				         DataDial.Dial_step_RetryTimer=Dial_max_Timeout;    
					  DataDial.Dial_step_Retry++;
					   if(DispContent)
 					     rt_kprintf(DialInit1);   
           
					break;
		      case Dial_DialInit1:   
			  	    #ifdef MC8332_CDMA
                        rt_hw_gsm_output("AT\r\n");  
					#endif
                    DataDial.Dial_step_RetryTimer=Dial_max_Timeout; 
					DataDial.Dial_step_Retry++;

					#ifndef MC8332_CDMA 
					if(DispContent)
					 {
					   len=strlen((const char*)Dialinit_APN); 
					   for(i=0;i<len;i++)										
					         rt_kprintf("%c",Dialinit_APN[i]);     
					 } 
					#endif

				       break;			
		     case Dial_DialInit2:     
			 	    rt_hw_gsm_output(DialInit2);
                    DataDial.Dial_step_RetryTimer=Dial_max_Timeout;  
					DataDial.Dial_step_Retry++;

                     if(DispContent)
					{
					 len=strlen((const char*)DialInit2);
					for(i=0;i<len;i++)										
					         rt_kprintf("%c",DialInit2[i]);   
					}

				       break;
		     case  Dial_DialInit3:  
			 	       rt_hw_gsm_output(DialInit3);
                                   DataDial.Dial_step_RetryTimer=Dial_max_Timeout; 
					DataDial.Dial_step_Retry++;
					 if(DispContent)
					 	{
							 len=strlen((const char*)DialInit3);
							for(i=0;i<len;i++)										
							         rt_kprintf("%c",DialInit3[i]);      
					 	}
				       break;			   
		     case Dial_DialInit4:    rt_hw_gsm_output(DialInit6); // AT
                                   DataDial.Dial_step_RetryTimer=Dial_max_Timeout;
					DataDial.Dial_step_Retry++;
					 if(DispContent)
					 {
						 len=strlen((const char*)DialInit6);
						for(i=0;i<len;i++)										
						         rt_kprintf("%c",DialInit6[i]);  
					  }
					break;
		     
		    case Dial_DialInit5:    rt_hw_gsm_output(DialInit4);
                                   DataDial.Dial_step_RetryTimer=Dial_Dial_Retry_Time; 
					DataDial.Dial_step_Retry++;
					 if(DispContent)
					{
						len=strlen((const char*)DialInit4);
						for(i=0;i<len;i++)										
						         rt_kprintf("%c",DialInit4[i]);       
					 }
				       break;	
		    case Dial_DialInit6:    rt_hw_gsm_output(DialInit8);  // Query  IP 
                                   DataDial.Dial_step_RetryTimer=Dial_Dial_Retry_Time; 
					DataDial.Dial_step_Retry++;
					 if(DispContent)
				    {
						 len=strlen((const char*)DialInit8);
						for(i=0;i<len;i++)										
						         rt_kprintf("%c",DialInit8[i]);     
					}

				       break;	 	
		    case Dial_DNSR1:    rt_hw_gsm_output(Dialinit_DNSR);  // main DNSR
                                   DataDial.Dial_step_RetryTimer=Dial_max_Timeout; 
					DataDial.Dial_step_Retry++;
					rt_kprintf("\r\n   ----- Link  main  DNSR ----\r\n");
					if(DispContent)
				   {
					 len=strlen((const char*)Dialinit_DNSR);
					for(i=0;i<len;i++)										
					         rt_kprintf("%c",Dialinit_DNSR[i]);    
				   }
				   else
				   	   rt_kprintf("\r\n        DNSR:%s\r\n",DomainNameStr);
                                   Dial_jump_State=7;
					Dnsr_state=1;//表示DNSR 状态下拨号 				   
				       break;	 
            case Dial_DNSR2:    rt_hw_gsm_output(Dialinit_DNSR2);  // Aux DNSR
                                   DataDial.Dial_step_RetryTimer=Dial_max_Timeout; 
					DataDial.Dial_step_Retry++;
					rt_kprintf("\r\n   ----- Link  Aux  DNSR ----\r\n");
				   if(DispContent)
				   {
					 len=strlen((const char*)Dialinit_DNSR2);
					for(i=0;i<len;i++)										
					         rt_kprintf("%c",Dialinit_DNSR2[i]);  
				   	}
				   else
				       rt_kprintf("\r\n       DNSR:%s\r\n",DomainNameStr_aux);
                                   Dial_jump_State=8; 
					Dnsr_state=1;//表示DNSR 状态下拨号 				   
				       break;	 					   
		    case Dial_DialInit7:    rt_hw_gsm_output(DialInit8);  // Query  IP 
                                   DataDial.Dial_step_RetryTimer=Dial_Dial_Retry_Time; 
					DataDial.Dial_step_Retry++;
					  if(DispContent)
				      {
					 len=strlen((const char*)DialInit8);
					for(i=0;i<len;i++)										
					         rt_kprintf("%c",DialInit8[i]);    
					 }

				       break;	   
		     case Dial_MainLnk:   // rt_hw_gsm_output(DialStr_Link1); 
		                       if( Dnsr_state==0)//表示DNSR 状态下拨号 	 
		                       	{
		                       	   rt_kprintf("\r\n Dial  orginal   Mainlink\r\n");  
                                            DataLink_MainSocket_set(RemoteIP_main,RemotePort_main,0);
		                       	}
							   
                                   DataDial.Dial_step_RetryTimer=3000; 
					DataDial.Dial_step_Retry++;
					 len=strlen((const char*)DialStr_Link1); 
					 for(i=0;i<len;i++)										
					   {
					        rt_hw_gsm_putc (DialStr_Link1[i]);     
					   }	
					for(i=14;i<len;i++)										
					   {
					        rt_kprintf("%c",DialStr_Link1[i]);     
					   }		
					break; 
		      case Dial_AuxLnk:   // rt_hw_gsm_output(DialStr_IC_card); 
                                   DataDial.Dial_step_RetryTimer=3000;
					DataDial.Dial_step_Retry++;
					 len=strlen((const char*)DialStr_LinkAux); 
					 for(i=0;i<len;i++)										
					   {
					        rt_hw_gsm_putc (DialStr_LinkAux[i]);     
					   }	
					  if(DispContent)
				      { 
						for(i=0;i<len;i++)										
						   {
						        rt_kprintf("%c",DialStr_LinkAux[i]);     
						   }		
					  }
					break; 	
 		     case   Dial_ISP:
 				    DataDial.Dial_step_RetryTimer=Dial_max_Timeout;
					DataDial.Dial_step_Retry++;
					 len=strlen((const char*)DialStr_IC_card); 
					 for(i=0;i<len;i++)										
					   {
					        rt_hw_gsm_putc (DialStr_IC_card[i]);     
					   }	
					 rt_kprintf("\r\n	----- Link	IC ----\r\n");		
					   if(DispContent)
				       {
						  for(i=0;i<len;i++)										
						   {
						        rt_kprintf("%c",DialStr_IC_card[i]);     
						   }	
					   	}
					break;				
		      default:
			  	       break;
             	}

