nathanlnw/TJ_TW703_cdma/bsp/stm32f407vgt6_RecDrv/app_712/gsm/Device_gsm.c
       }  



}

static void GSM_Process(u8 *instr, u16 len)
{
      	u8	ok = false;
		u8	error = false;
		u8	failed = false; 
		u8	connect = false;   		
        u16  i=0,j=0,q=0;//,len=0;//j=0;
         u8 reg_str[80]; 
//----------------------  Debug -------------------------		
  // if(DispContent==2)	 
   memset(GSM_rx,0,sizeof((const char*)GSM_rx));
   memcpy(GSM_rx,instr,len);
   
  if((BD_ISP.ISP_running==0)&&(DispContent))      
   {
        rt_kprintf("\r\n");      
        for(i=0;i<len;i++)  
		{ 
		   rt_kprintf("%c",GSM_rx[i]);  
        }
   }    

   //------------------------------------------------------------------------------------------------------------------- 
  #ifdef MC8332_CDMA
      if(strncmp((char*)GSM_rx, "+ZTTS:0",7)==0)  // MC8332
  #endif 	
	{
                 TTS_Play_End();
		    rt_kprintf("\r\n   TTS  播放完毕\r\n");   
			Speak_OFF;
	}
#ifdef  SMS_ENABLE
	//--------      SMS  service  related Start  -------------------------------------------
	//+CMTI: "SM",1            +CMTI: "SM",1  +CMTI: "MT",0
	if( strncmp( (char*)GSM_rx, "+CMTI: \"SM\",", 12 ) == 0 )
	{
		rt_kprintf( "\r\n收到短信:" );
		j = sscanf( GSM_rx + 12, "%d", &i );
		if( j )
		{
			SMS_Rx_Notice(i);	
		}
	}
	else if( strncmp( (char*)GSM_rx, "+CMT: ", 6 ) == 0 )
	{
		if(GSM_rx[6]==',')		///PDU模式
		{
			if( RT_EOK == rt_mq_recv( &mq_GSM, (void*)&GSM_RX_BUFF, GSM_TYPEBUF_SIZE, RT_TICK_PER_SECOND ) )    //等待1000ms,实际上就是变长的延时,最长1000ms
			{
				memset( GSM_rx, 0, sizeof( GSM_rx ) );
				memcpy( GSM_rx, GSM_RX_BUFF.gsm_content, GSM_RX_BUFF.gsm_wr );
				len=GSM_RX_BUFF.gsm_wr;

				SMS_Rx_PDU(GSM_rx,len); 
			}
		}
		else					///TEXT模式
		{
			j	= 0;
			q	= 0;
			memset( reg_str, 0, sizeof( reg_str ) );
			for( i = 6; i < len; i++ )
			{
				if( ( j == 1 ) && ( GSM_rx[i] != '"' ) )
				{
					reg_str[q++] = GSM_rx[i];
				}
				if( GSM_rx[i] == '"' )
				{
					j++;
					if(j>1)
						break;
				}
			}
			//rt_kprintf( "\r\n  短息来源号码:%s \r\n", reg_str );
			if( RT_EOK == rt_mq_recv( &mq_GSM, (void*)&GSM_RX_BUFF, GSM_TYPEBUF_SIZE, RT_TICK_PER_SECOND ) )    //等待1000ms,实际上就是变长的延时,最长1000ms
			{
				memset( GSM_rx, 0, sizeof( GSM_rx ) );
				memcpy( GSM_rx, GSM_RX_BUFF.gsm_content, GSM_RX_BUFF.gsm_wr );
				len=GSM_RX_BUFF.gsm_wr;
				SMS_Rx_Text(GSM_rx,reg_str);
			}
		}
		
	}
#ifdef SMS_TYPE_PDU
	else if( strncmp( (char*)GSM_rx, "+CMGR:", 6 ) == 0 )
	{
		if( RT_EOK == rt_mq_recv( &mq_GSM, (void*)&GSM_RX_BUFF, GSM_TYPEBUF_SIZE, RT_TICK_PER_SECOND ) )    //等待1000ms,实际上就是变长的延时,最长1000ms
		{
			memset( GSM_rx, 0, sizeof( GSM_rx ) );
			memcpy( GSM_rx, GSM_RX_BUFF.gsm_content, GSM_RX_BUFF.gsm_wr );
			len=GSM_RX_BUFF.gsm_wr;

			SMS_Rx_PDU(GSM_rx,len);
		}
	}
#else
	else if( strncmp( (char*)GSM_rx, "+CMGR:", 6 ) == 0 )
	{
		//+CMGR: "REC UNREAD","8613602069191", ,"13/05/16,13:05:29+35"
		// 获取要返回短息的目的号码
		j	= 0;
		q	= 0;
		memset( reg_str, 0, sizeof( reg_str ) );
		for( i = 6; i < 50; i++ )
		{
			if( ( j == 3 ) && ( GSM_rx[i] != '"' ) )
			{
				reg_str[q++] = GSM_rx[i];
			}
			if( GSM_rx[i] == '"' )
			{
				j++;
			}
		}
		//rt_kprintf( "\r\n  短息来源号码:%s \r\n", reg_str );
		if( RT_EOK == rt_mq_recv( &mq_GSM, (void*)&GSM_RX_BUFF, GSM_TYPEBUF_SIZE, RT_TICK_PER_SECOND ) )    //等待1000ms,实际上就是变长的延时,最长1000ms
		{
			memset( GSM_rx, 0, sizeof( GSM_rx ) );
			memcpy( GSM_rx, GSM_RX_BUFF.gsm_content, GSM_RX_BUFF.gsm_wr );
			len=GSM_RX_BUFF.gsm_wr;
			SMS_Rx_Text(GSM_rx,reg_str);			
		}
	}
#endif

#endif
	
    #ifdef MC8332_CDMA  
     //+CMTI: "MT",0
    //+CMTI: "SM",1            +CMTI: "SM",1  +CMTI: "MT",0
	if( strncmp( (char*)GSM_rx, "+CMTI: \"MT\",", 12 ) == 0 )
	{
		rt_kprintf( "\r\n收到cdma短信:" );
		j = sscanf( GSM_rx + 12, "%d", &i ); 
		if( j )
		{
			SMS_Rx_Notice(i);	 
		}
	}
	else
    if(strncmp((char*)GSM_rx, "+CIMI: 460",10) == 0)	 // +CIMI: 460036871693080
	{
	      CommAT.Total_initial=1;	// 进行参数配置
		  rt_kprintf("\r\n获取IMSI 号码:%s \r\n",GSM_rx+7);       
		  memcpy((char*)IMSI_CODE,(char*)GSM_rx+7,15); 
		  RTC_TimeShow();
		  IMSIGet.imsi_error_count=0;	
		  IMSIGet.Get_state=1;
		  GSM_PWR.GSM_power_over=2;     //  get imsi
		  IMSIGet.Get_state=0;
		  CommAT.Total_initial=1;	// 进行参数配置  
		 
	}
	else
    if(strncmp((char*)GSM_rx, "+GETICCID:0x",12) == 0)	 // +GETICCID:0x89860312908712564960
	{
	        for(i=0;i<10;i++)
           {
              ProductAttribute._5_Sim_ICCID[ok]=((GSM_rx[12+2*i]-0x30)<<4)+(GSM_rx[12+2*i]-0x30);
              ok++;
           }
		 
	}
	else

    if(strncmp((char*)GSM_rx, "+ZDNSGETIP: failed",18) == 0)     //+ZDNSGETIP: failed
	{
	         rt_kprintf("\r\n   域名解析失败\r\n");    
	 		 if((Dial_jump_State==7)||(Dial_jump_State==8))
				Dial_jump_State=0;    
		        Dnsr_state=0;//表示DNSR 状态下拨号 	 

	}
	else      //+ZDNSGETIP:113.31.28.101
    if(strncmp((char*)GSM_rx, "+ZDNSGETIP:",11) == 0)
	{  //%DNSR:113.31.28.100
		//%DNSR:0.0.0.0 
	        {                   
	                    
				i =str2ip((char*)GSM_rx+11, RemoteIP_Dnsr); 
				if (i <= 3) failed = true; 
			    DataLink_MainSocket_set(RemoteIP_Dnsr,RemotePort_main,1);
                rt_kprintf("\r\n   域名解析成功\r\n"); 

				Dial_Stage(Dial_MainLnk);  //--   切换到拨号    
				return ;
		}
    }
	   //+ZNEWIP:42.80.43.113
	   // +ZPPPSTATUS: OPENED
       //============================================================================   
       /*
                +ZTCPESTABLISHED:0
                +ZDORMANT: READY             
	    */   
	   else
	   if(strncmp((char*)GSM_rx, "+ZTCPESTABLISHED:0",18) == 0)    
	   	{
                connect=true;
		}
       //-----------------------------------------------------------------------------------------
        //  +ZIPSEND: 60    发送完毕  
        else
        if(strncmp((char*)GSM_rx, "+ZIPSEND:",9) == 0)    
        {
            if(Send_Rdy4ok==1)
		   	{
		   	    Api_cycle_Update();
			    Send_Rdy4ok=0;	
				Online_error_counter=0; // clear 
		   	}
		    WatchDog_Feed();      
        }
	   //-----------------------------------------
       // +ZIPRECV:0,32,~                  +ZIPRECV:0,
      else 
	  if(strncmp((char*)GSM_rx, "+ZIPRECV:0,",11) == 0)    
	  	{
           for(i=0;i<20;i++)   //  从前20个字节中找第一个"
			{
				if(GSM_rx[i+11]==',') 
					break;
			} 
		  info_len=len-i-5;  	  
		
			sscanf(GSM_rx+11, "%d", (u32*)&info_len); 	
		   // rt_kprintf("\r\n rxlen=%d\r\n",info_len);      
			WatchDog_Feed();
		  // if(BD_ISP.ISP_running==1)  
			//  OutPrint_HEX("rx",GSM_rx+i+12,info_len);   
			Get_GSM_HexData(GSM_rx+i+12,info_len,0);     
	         goto RXOVER; 	 

