nathanlnw/TJ_TW703_cdma/bsp/stm32f407vgt6_RecDrv/app_712/gsm/Device_gsm.c
	  	}
	  else
	    if(strncmp((char*)GSM_rx, "+CME ERROR: 3",13) == 0)  
	    {
	        if(DataDial.Dial_step!=Dial_DialInit1)
	        {
               if(DataLink_Status())        //   Online  state  Error    , End Link and Redial    
			   {
		              Online_error_counter++;
					  if(Online_error_counter>3)	 
				         {   
				                DataLink_EndFlag=1; //AT_End();    
		                        Online_error_counter=0;
					  }
				      rt_kprintf("\r\n C Online error\r\n"); 	       
			   	}
			   rt_kprintf("\r\n  C ERROR\r\n");  
	         }   
	    }
     else
	    if(strncmp((char*)GSM_rx, "+ZPPPSTATUS: OPENED",19) == 0)   
        {              
			  connect=true;
	    }

		
	    if(strncmp((char*)GSM_rx, "+ZCEND:",7) == 0)    //+ZCEND:28
	    {
             Speak_OFF; //关闭功放
	    }

		//+VGR: 1
		else
		if( strncmp( (char*)GSM_rx, "+VGR:", 5 ) == 0 )
	    {
			
			j = sscanf( GSM_rx + 6, "%d", &i );
			rt_kprintf( "\r\n获取音量: %d ",j );
			if( i<=2)
			 {	 
			    Menu_voice_value=0;// 音量小
				 rt_kprintf( " 等级  1\r\n");
			  }
			else
			if(i<=4)
			{
				Menu_voice_value=1;// 音量中
                 rt_kprintf( " 等级  2\r\n");
			}
			else
			if(i<=7)	
			{
				Menu_voice_value=2;// 音量大
                rt_kprintf( " 等级  3\r\n"); 
			}

	    }
        else     //+CMGS:19 
		if( strncmp( (char*)GSM_rx, "+CMGS:", 6 ) == 0 )  
	    {
			
			j = sscanf( GSM_rx + 6, "%d", &i );
			rt_kprintf( "\r\n +CMGS: %d ",i );
			if( i>=30)  
			 {	 
			   Delete_all_sms_flag=1;  
			 }
	    } 
		if( strncmp( (char*)GSM_rx, "+ZCEND:25", 9 ) == 0 )  
		{   //+ZCEND:25
		              
		     CallState=CallState_Idle;	
			  Speak_OFF;// 关闭功放 
			 failed = true;
			 rt_kprintf("\r\n Callstate=Idle\r\n"); 
		  }
		//+ZCEND
		// +ZPPPSTATUS: CLOSED
	   //============================================================================
	#endif
	else
	if(strncmp((char*)GSM_rx, "OK",2) == 0)  
		{				
		    ok = true;
		  if(DispContent)	
			   rt_kprintf(" OK\r\n");     			

		  //   Online  state  OK  ,clear Error Counter
	        		
        }
	else
	if (strcmp((char*)GSM_rx, "NO DIALTONE") == 0) failed = true;
	else
	if (strcmp((char*)GSM_rx, "NO ANSWER") == 0) failed = true;
	if (strncmp((char*)GSM_rx, "NO CARRIER",10) == 0) 
	{                      //  NO CARRIER  
		 CallState=CallState_Idle;	
		  Speak_OFF;// 关闭功放 
		 failed = true;
		 rt_kprintf("\r\n Callstate=Idle\r\n");    
	}   
	if(strcmp((char*)GSM_rx, "BUSY") == 0)  
	{ 
		// ZHinfotype=ZH_01H;//  车台向终端发送振铃指示
		 //subtype=0x12;	   //挂断
		 CallState=CallState_Idle;	
		 failed = true; 
		// Off_speaker;		// 关闭功放 
		 //Clip_flag=0;
		 //Clip_counter=0; 
	
	}
	else
	if(strncmp((char*)GSM_rx,"+CSQ:",5)==0)	//场强信息
	{ //+CSQ: 27,99
				if ( GSM_rx[7] == ',' )
				{
						ModuleSQ = GSM_rx[6] - 0x30;   
				}
				else if ( GSM_rx[8] == ',' )
				{
						ModuleSQ = ( GSM_rx[6] - 0x30 ) * 10 + GSM_rx[7] - 0x30;
	
						if ( ModuleSQ == 99 )
						{
								ModuleSQ = 0;
						}
				}
	          //-------------------------------------- 
	 	      //  You must   register on 
	 		  if(CommAT.Total_initial==1)
	 			{
	                if((ModuleSQ>10)&&(CommAT.Initial_step==17))      
	 				{
	 				  CommAT.Initial_step++;
					  rt_kprintf("\r\n CSQ check Pass : %s\r\n",GSM_rx);      
	                }
	 			} 				 
		
	}
	else
	if ((strlen((char*)GSM_rx) >= 7) && (strncmp((char*)GSM_rx, "CONNECT", 7) == 0))
	{
	      connect=true;
	}
	
#ifdef MC8332_CDMA
	else
	if (strncmp((char*)GSM_rx, "ERROR",5) == 0) 
	{
	    rt_kprintf("\r\n rx _error \r\n");
	   error = true;
	   CallState=CallState_Idle;  
	   //----------------------
	   if(TTS_ACK_Error_Process()==true)
               {     rt_kprintf("\r\n  TTS ack  error \r\n");  Speak_OFF; }
	   else 
	   if(DataLink_Status())        //   Online  state  Error    , End Link and Redial    
	       {
	                   Online_error_counter++;
				  if(Online_error_counter>3)	 
			         {   
			                DataLink_EndFlag=1; //AT_End();    
	                              Online_error_counter=0;
				  }
			  rt_kprintf("\r\n Online error\r\n"); 	   
	   	}
	   rt_kprintf("\r\n ERROR\r\n");      
	}
#endif	
	else
	if (strncmp((char*)GSM_rx, "Unknown",7) == 0) 
		error = true;	

	//-------------  End  need	process ---------------------------------------
RXOVER:
       memset(GSM_rx, 0, sizeof(GSM_rx));
	GSM_rx_Wr = 0; 
	
	//---------------------  Function  Process Below --------------------------
	if ((DataDial.Dial_step != Dial_MainLnk) && failed) 
	{ 
		 Dial_Stage(Dial_Idle); 
		return;
	}
	
	switch (DataDial.Dial_step)
	{
		case Dial_DialInit0:	
			                     #ifndef MC8332_CDMA		  
			                         if (ok) 
                                 #endif
						         Dial_Stage(Dial_DialInit1);
								break;
		case Dial_DialInit1   : 			                   						     
			                    if (ok) Dial_Stage(Dial_DialInit2); 
								break;
		case Dial_DialInit2	:	if (ok)   Dial_Stage(Dial_DialInit3);
								break;
		case Dial_DialInit3	:	if (ok)   Dial_Stage(Dial_DialInit4);
								break;
		case Dial_DialInit4	:	
			                    #ifdef MC8332_CDMA
                                    if(connect)    
										   Dial_Stage(Dial_DialInit5);      
								#endif	
								break;
		case Dial_DialInit5	:	if (ok)  Dial_Stage(Dial_DialInit6);
								break;
		case Dial_DialInit6	:	if (ok)  
			                  /*
                                                            初始化完成后，选择首次连接的方式
			                                */
			                   if(Vechicle_Info.Link_Frist_Mode==1)
							   	      Dial_Stage(Dial_MainLnk);
							   else
							   	      Dial_Stage(Dial_DNSR1); 

		                       /*
					                    #ifdef MULTI_LINK
					                          Dial_Stage(Dial_DNSR1);   // 多连接  
								#else
								      Dial_Stage(Dial_MainLnk);
						             #endif
						             */
								break;						
		case Dial_DNSR1	:	if (ok)
			                           {
                                                         Dial_Stage(Dial_DNSR2);
			                           }   
								break;		
	    case Dial_DNSR2	:	if (ok)
			                           {
                                                          Dial_Stage(Dial_MainLnk); 
			                           }   
								break;							
		case Dial_MainLnk		:		
	    case Dial_AuxLnk	    :	if (failed || error)
								{
									DataDial.Dial_step_RetryTimer=Dial_Dial_Retry_Time;				// try again in 6 seconds
									break;
								} 
								 if (connect) 						
								{   //  below  run once  since  online
								     if(DataDial.Dial_step ==Dial_MainLnk)    //mainlink 
								             rt_kprintf("\r\n连接成功TCP---\r\n");
								     if(DataDial.Dial_step ==Dial_AuxLnk)    //auxlink 	 
								                rt_kprintf("\r\n Aux 连接成功TCP---\r\n");
								   //     1.   登陆成功后相关操作	 
								    // <--  注册状态
								    if(1==JT808Conf_struct.Regsiter_Status)   
								        {
								           DEV_Login.Operate_enable=1;  
										   if(DEV_Login.Sd_counter==0)
                                               DEV_Login.Enable_sd=1;    
								    	}
									else
										{
										  JT808Conf_struct.Regsiter_Status=0;  
										  if(DEV_regist.Sd_counter==0)
										     DEV_regist.Enable_sd=1; 
										}
									 
								   // connect = true;
								         //  -----  Data  Dial Related ------
									    if((DataDial.Dial_ON)&&(DataDial.Dial_step<Max_DIALSTEP)) 
									    	{
							                   Dial_Stage(Dial_Idle);
										       DataDial.Dial_step_Retry=0;
										       DataDial.Dial_step_RetryTimer=0;   			
									    	}
							              //-----------------------------------
							           //   DataDial.Dial_ON=0; 
								       DataLink_Online=enable;	  
									  DialLink_TimeOut_Clear(); 	  
									  
                                      #ifdef	MULTI_LINK
											   TCP2_ready_dial=1;	   
                                       #endif
									  
                                   //--------------------------------------------------------------------->
									 Dial_Stage(Dial_Idle); //  state  convert   
									 RTC_TimeShow();	
						             }						           
							      //------------------------------------------							
								 break;  
		     case Dial_ISP:
			 	                if (failed || error)
								{
									DataDial.Dial_step_RetryTimer=Dial_Dial_Retry_Time;
									break;
								}
								 if (connect) 
								{
									 Dial_Stage(Dial_Idle); //	In EM310 Mode										
									TCP2_Connect=1;		
									TCP2_sdFlag=1;
									TCP2_ready_dial=0;  
									rt_kprintf("\r\n TCP 连接成功-ISP!\r\n");     
									 DataDial.Dial_ON=0;  // 
								}							 
								break;		 						
		default 			:	 Dial_Stage(Dial_Idle);
	                                          DataDial.Dial_step_Retry=0;	
								break;
	}
    //-----------
}

void  IMSIcode_Get(void)
{

        if(GSM_PWR.GSM_power_over==1)
		{
               IMSIGet.Checkcounter++;
		       if(IMSIGet.Checkcounter>20)     //  15*30=450ms      
		   	{
                 IMSIGet.Checkcounter=0; 
			    if(IMSIGet.Get_state==1)
	               {
	                 rt_hw_gsm_output(IMSI_Check_str);    // 查询 IMSI_CODE 号码 
	                 rt_kprintf(IMSI_Check_str);  
		         }  
			  else 
			   {
			  	   rt_hw_gsm_output(SIM_Check_Str);    // 先检查 SIM 卡的存在
		                 rt_kprintf(SIM_Check_Str);    
			   }
		   	} 
		}  
}

