nathanlnw/TJ_TW703_cdma/bsp/stm32f407vgt6_RecDrv/app_712/gsm/Device_gsm.c
#if 0 
 void Rx_in(u8* instr)
 {
	 u16  inlen=0;
 
	   if(strncmp(instr,"can1",4)==0)
		 {
			Get_GSM_HexData("7E8103003B013601300001864F060000010004000001F40000010102000A0000010204000000000000010302000000000110080000000058FFD11700000111080000006458FFD017EA7E",148,0);
			OutPrint_HEX("模拟1", GSM_HEX, GSM_HEX_len); 
 
	  }
		 else
		 {
			  inlen=strlen((const char*)instr);
			  Get_GSM_HexData(instr,inlen,0);  
			   OutPrint_HEX("模拟", GSM_HEX, GSM_HEX_len); 
		 }	  
 
 }
 FINSH_FUNCTION_EXPORT(Rx_in, Rx_in);
 #endif

void  cplay(u8 in)
 {
      // rt_hw_gsm_output("AT+ZTTS=1,\"2c67448d99652c67448d99652c67448d99652c67448d99652c67448d99652c67448d99652c67448d99652c67448d9965\"\r\n");   
     if(in==1)
	  rt_hw_gsm_output("AT+ZTTS=1,\"EA818C4EF696004E094E745E4351E6654750E565895B92636C51035E0E540CFF76511C20114F4750F69663651D208C541C2082820E54858D7F95E55D2866E5651D20D7533052288D917502304B4E0E540CFF776D575301773F659C5E1A90C78F985B517FD153035E1A90E577F079065C3E4E9E5268510177226B504E\"\r\n");
     else
	 if(in==2)	
		 rt_hw_gsm_output("AT+ZTTS=2,\"CDE2BDBBB2BFB8B1B2BFB3A4D5C5D6BEBEFCD7F2CCECB4F2B5E7BBB0B8F8C8D5B1BECDE2CEF1CAA1B3A3CEF1B8B1CDE2B3A4D7F4D7F4BDADCFCDD2BBC0C9\"\r\n");
	 else	 	  
	 rt_hw_gsm_output("AT+ZTTS=0,\"EA818C4EF696004E094E745E4351E6654750E565895B92636C51035E0E540CFF76511C20114F4750F69663651D208C541C2082820E54858D7F95E55D2866E5651D20D7533052288D917502304B4E0E540CFF776D575301773F659C5E1A90C78F985B517FD153035E1A90E577F079065C3E4E9E5268510177226B504E\"\r\n");
 } 
 FINSH_FUNCTION_EXPORT(cplay, cplay);  

void  catd(void)
 {
      // rt_hw_gsm_output("AT+ZTTS=1,\"2c67448d99652c67448d99652c67448d99652c67448d99652c67448d99652c67448d99652c67448d99652c67448d9965\"\r\n");   
	   rt_hw_gsm_output("ATD112;\r\n");
 } 
 FINSH_FUNCTION_EXPORT(catd, catd);  


void AT(char *str)
{
	rt_hw_gsm_output((const char*)str);     
	rt_hw_gsm_output("\r\n"); 
	rt_kprintf("%s\r\n",str);
	   
} 
FINSH_FUNCTION_EXPORT(AT, AT);



void  rt_hw_gsm_init(void)
{

       GPIO_InitTypeDef GPIO_InitStructure;
	USART_InitTypeDef USART_InitStructure;
	NVIC_InitTypeDef NVIC_InitStructure;
	


      RCC_AHB1PeriphClockCmd( RCC_AHB1Periph_GPIOC|RCC_AHB1Periph_GPIOD, ENABLE );
      RCC_APB1PeriphClockCmd( RCC_APB1Periph_UART4, ENABLE );



/*uart4 管脚设置*/

	/* Configure USART Tx as alternate function  */
	GPIO_InitStructure.GPIO_OType = GPIO_OType_PP; 
	GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;  
       GPIO_InitStructure.GPIO_Pin = GSM_TX_PIN| GSM_RX_PIN;
	GPIO_Init( GPIOC, &GPIO_InitStructure );

    GPIO_PinAFConfig(GPIOC, GPIO_PinSource10, GPIO_AF_UART4);      
    GPIO_PinAFConfig(GPIOC, GPIO_PinSource11, GPIO_AF_UART4);      

	

	NVIC_InitStructure.NVIC_IRQChannel = UART4_IRQn;
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 1;
	NVIC_InitStructure.NVIC_IRQChannelSubPriority =0; 
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
	NVIC_Init(&NVIC_InitStructure);

    #ifdef MC8332_CDMA
	USART_InitStructure.USART_BaudRate =115200;   // new M66  57600  
	#endif
	
	USART_InitStructure.USART_WordLength = USART_WordLength_8b;
	USART_InitStructure.USART_StopBits = USART_StopBits_1;
	USART_InitStructure.USART_Parity = USART_Parity_No;
	USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
	USART_InitStructure.USART_Mode = USART_Mode_Rx | USART_Mode_Tx;  
	USART_Init(UART4, &USART_InitStructure);
	/* Enable USART */
	USART_Cmd(UART4, ENABLE);
	USART_ITConfig( UART4, USART_IT_RXNE, ENABLE );   

			 
   /* -------------- GPRS  GSM	模块 EM310 操作相关 -----------------	*/
   /*
		   STM32 Pin	 SIM300 gprs  Pin		   Remark
			 PD12		   Power				  PE2 set 1: Power On  set	0: Poweroff 
			 PD13	   PWRKEY				   加了反向三极管	PA5 set 1:Off	   0: On 
	*/
  
   /*  管脚初始化 设置为 推挽输出 */

   RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOD, ENABLE);


  GPIO_InitStructure.GPIO_Pin = GPRS_GSM_Power ; 
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_100MHz;
  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
  GPIO_Init(GPIOD, &GPIO_InitStructure);	
   
   GPIO_InitStructure.GPIO_Pin = GPRS_GSM_PWKEY;
   GPIO_Init(GPIOD, &GPIO_InitStructure);	
   
   GPIO_InitStructure.GPIO_Pin =GPRS_GSM_RST;		//-----  Reset 常态下置低   高有效  
   GPIO_Init(GPIOD, &GPIO_InitStructure);   


   GPIO_InitStructure.GPIO_Pin =Speak_Ctrl;		//-----  功放
   GPIO_Init(GPIOD, &GPIO_InitStructure);   	 
   //==================================================================== 
   #ifdef  MC8332_CDMA
       GPIO_SetBits(GPIOD,GPRS_GSM_RST);   // 常态置高控低  
   #endif   
   
   GPIO_ResetBits(GPIOD,GPRS_GSM_Power);
   GPIO_ResetBits(GPIOD,GPRS_GSM_PWKEY);    //M66 常态下置低      控高
   
  Speak_OFF;//  关闭音频功放  
  //Speak_ON;  // debug

/*
    GPIO_InitStructure.GPIO_Pin =GPIO_Pin_2;		//GPS  串口拉低
   GPIO_Init(GPIOD, &GPIO_InitStructure);   

     GPIO_InitStructure.GPIO_Pin =GPIO_Pin_12;		//GPS  串口拉低
   GPIO_Init(GPIOC, &GPIO_InitStructure);   
     GPIO_ResetBits(GPIOC,GPIO_Pin_12);      
    GPIO_ResetBits(GPIOD,GPIO_Pin_2);      	   

 // Speak_ON;  
 */
}
